<p><time>2015-09-11</time></p>
<h1>&#x411;&#x43B;&#x43E;&#x433; &#x43D;&#x430; &#x430;&#x43D;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x435;</h1>
<p>&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x43B;&#x43E;&#x433;&#x43E;&#x432; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x438; &#x438; &#x441;&#x43E;&#x442;&#x43D;&#x438;. &#x41D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x448;&#x44C; &#x43E;&#x442;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F;.. &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x435;&#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D;. C&#x432;&#x43E;&#x439; &#x432;&#x435;&#x43B;&#x43E;&#x441;&#x438;&#x43F;&#x435;&#x434;.</p>
<h3>&#x418;&#x434;&#x435;&#x44F;</h3>
<p>&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F; &#x43C;&#x44B;&#x441;&#x43B;&#x44C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x432; &#x43E;&#x444;&#x444;&#x43B;&#x430;&#x439;&#x43D;, &#x432; &#x441;&#x432;&#x43E;&#x435;&#x43C; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x435;, &#x43D;&#x430; &#x44F;&#x437;&#x44B;&#x43A;&#x435; markdown &#x438; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x438; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x430;, &#x437;&#x430;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x442;&#x44C;. &#x422;&#x430;&#x43A; &#x436;&#x435;, &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E; &#x43D;&#x438;&#x43C;, &#x434;&#x430; &#x438; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x441;&#x44F; &#x44D;&#x442;&#x430; &#x448;&#x442;&#x443;&#x43A;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x439; =)</p>
<h3>&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;</h3>
<p>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; AngularJS framework &#x442;.&#x43A;. &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x43F;&#x44B;&#x442;&#x430; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x441; &#x43D;&#x438;&#x43C;. &#x41D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x44E; &#x434;&#x435;&#x43B;&#x430;&#x43B; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <a href="https://github.com/angular-ui/ui-router">ui-router</a>. &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B; &#x435;&#x433;&#x43E; &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435;, &#x438; &#x437;&#x43D;&#x430;&#x43B; &#x43A;&#x430;&#x43A; &#x441; &#x43D;&#x438;&#x43C; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x434;&#x435;&#x43B;&#x43E;.<br>
&#x41D;&#x438; &#x441; &#x43A;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x411;&#x414; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43D;&#x435; &#x432;&#x43E;&#x437;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x430; &#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x438;&#x442;&#x44C; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443;&#x44E; &#x438;&#x434;&#x435;&#x44E;. &#x418;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x435; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435;, &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x435; markdown &#x438; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x438;&#x437; &#x43D;&#x435;&#x433;&#x43E; html.</p>
