<p><time>2015-09-14</time></p>
<h1>&#x411;&#x43B;&#x43E;&#x433; &#x43D;&#x430; &#x430;&#x43D;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x435;</h1>
<p>&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x43B;&#x43E;&#x433;&#x43E;&#x432; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x438; &#x438; &#x441;&#x43E;&#x442;&#x43D;&#x438;. &#x41D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x448;&#x44C; &#x43E;&#x442;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F;... &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x435;&#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D;. &#x421;&#x432;&#x43E;&#x439; &#x432;&#x435;&#x43B;&#x43E;&#x441;&#x438;&#x43F;&#x435;&#x434;.</p>
<h2>&#x418;&#x434;&#x435;&#x44F;</h2>
<p>&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F; &#x43C;&#x44B;&#x441;&#x43B;&#x44C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x432; &#x43E;&#x444;&#x444;&#x43B;&#x430;&#x439;&#x43D;, &#x432; &#x441;&#x432;&#x43E;&#x435;&#x43C; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x435;, &#x43D;&#x430; &#x44F;&#x437;&#x44B;&#x43A;&#x435; markdown &#x438; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x438; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x430;, &#x437;&#x430;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x442;&#x44C;. &#x422;&#x430;&#x43A; &#x436;&#x435;, &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E; &#x43D;&#x438;&#x43C;, &#x434;&#x430; &#x438; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x441;&#x44F; &#x44D;&#x442;&#x430; &#x448;&#x442;&#x443;&#x43A;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x439; =)</p>
<h2>&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;</h2>
<p>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; AngularJS Framework &#x442;.&#x43A;. &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x43F;&#x44B;&#x442;&#x430; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x441; &#x43D;&#x438;&#x43C;. &#x41D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x44E; &#x434;&#x435;&#x43B;&#x430;&#x43B; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <a href="https://github.com/angular-ui/ui-router">ui-router</a>. &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B; &#x435;&#x433;&#x43E; &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435;, &#x438; &#x437;&#x43D;&#x430;&#x43B; &#x43A;&#x430;&#x43A; &#x441; &#x43D;&#x438;&#x43C; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x434;&#x435;&#x43B;&#x43E;.<br>
&#x41D;&#x438; &#x441; &#x43A;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x411;&#x414; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43D;&#x435; &#x432;&#x43E;&#x437;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x430; &#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x438;&#x442;&#x44C; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443;&#x44E; &#x438;&#x434;&#x435;&#x44E;. &#x418;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x435; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435;, &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x435; markdown &#x438; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x438;&#x437; &#x43D;&#x435;&#x433;&#x43E; html.<br>
&#x412;&#x441;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x43F;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x44E; &#x438; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x43E;&#x441;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43C;&#x435;&#x43D;&#x435;&#x434;&#x436;&#x435;&#x440; &#x437;&#x430;&#x434;&#x430;&#x447; <a href="http://gulpjs.com/">GulpJS</a>.<br>
&#x412; &#x435;&#x433;&#x43E; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x445;&#x43E;&#x434;&#x438;&#x442;:</p>
<ul>
<li>&#x421;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;, &#x434;&#x43B;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x431;&#x43B;&#x43E;&#x433;&#x43E;&#x43C;.</li>
<li>&#x410;&#x43D;&#x430;&#x43B;&#x438;&#x437; markdown &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x438; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x438;&#x435; json &#x444;&#x430;&#x439;&#x43B;&#x430;.</li>
</ul>
<p><em>(json &#x444;&#x430;&#x439;&#x43B; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x434;&#x430;&#x442;&#x443;, &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;, &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; markdown &#x444;&#x430;&#x439;&#x43B;&#x430; &#x438; &#x435;&#x449;&#x435; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x435;&#x439;, &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; &#x432; &#x43C;&#x435;&#x43D;&#x44E; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438;)</em></p>
<ul>
<li>&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; markdown &#x432; html.</li>
<li>&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; less &#x432; css.</li>
<li>&#x41C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; css.</li>
</ul>
<p>&#x422;&#x430;&#x43A; gulp &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; git, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x439; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C;, &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x438;&#x442;&#x44C; &#x438; &#x437;&#x430;&#x43F;&#x443;&#x448;&#x438;&#x442;&#x44C; &#x431;&#x43B;&#x43E;&#x433; &#x43D;&#x430; github &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x439;.</p>
<h3>&#x41D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x44F;</h3>
<p>&#x421;&#x442;&#x430;&#x442;&#x44C;&#x44E; &#x432; &#x43C;&#x435;&#x43D;&#x44E; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438; &#x441;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E; &#x433;&#x43E;&#x434;&#x430;&#x43C; &#x438; &#x43C;&#x435;&#x441;&#x44F;&#x446;&#x430;&#x43C;, &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C;&#x438; &#x438;&#x434;&#x443;&#x442; &#x441;&#x430;&#x43C;&#x44B;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x435;. &#x414;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430; &#x441;&#x442;&#x430;&#x442;&#x435;&#x439; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x443;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x44B; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x435; &#x43E;&#x43A;&#x43E;&#x43D;&#x447;&#x430;&#x43D;&#x438;&#x435; <strong>_reverse</strong> &#x433;&#x434;&#x435; &#x44D;&#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;. &#x418;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x435;&#x43D;&#x44E; &#x441;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x43E;, &#x43F;&#x440;&#x438; &#x43A;&#x43B;&#x438;&#x43A;&#x435; &#x43D;&#x430; &#x433;&#x43E;&#x434; &#x440;&#x430;&#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43C;&#x435;&#x441;&#x44F;&#x446;&#x44B;, &#x440;&#x438; &#x43A;&#x43B;&#x438;&#x43A;&#x435; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x44F;&#x446; - &#x43F;&#x43E;&#x441;&#x442;&#x44B;.<br>
&#x415;&#x441;&#x43B;&#x438; url &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x44E; &#x43D;&#x430; &#x43A;&#x430;&#x43A;&#x443;&#x44E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x443;&#x44E;&#x441;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44E;, &#x442;&#x43E; &#x43F;&#x440;&#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44F;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F;.</p>
<p>&#x414;&#x430;&#x442;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x435; &#x432; &#x43C;&#x435;&#x43D;&#x44E;, &#x43F;&#x438;&#x448;&#x435;&#x442; &#x441;&#x430;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x432; &#x442;&#x435;&#x433;&#x435; <strong>&lt;time&gt;</strong>. &#x42D;&#x442;&#x43E; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x43E;&#x441;&#x430; &#x441;&#x442;&#x430;&#x442;&#x435;&#x439; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x43E;&#x432;, &#x438; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x430;&#x442;&#x44B; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x445; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; (<a href="http://feelenergycb.github.io/blog/#/css3-pseudoclasses">&#x41A;&#x430;&#x43A; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x44D;&#x442;&#x430; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F;</a>). &#x424;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x434;&#x430;&#x442;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x435; new Date() javascript&apos;a. &#x413;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x435; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x434;&#x430;&#x442;&#x430; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43B;&#x430; &#x433;&#x43E;&#x434; &#x438; &#x43C;&#x435;&#x441;&#x44F;&#x446;, &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x439; &#x441;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x438;.</p>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; 1 h1 &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A; (&#x432; markdown &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <strong>#</strong>). &#x41E;&#x43D; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x432; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C; &#x43C;&#x435;&#x43D;&#x44E;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x43E;&#x435;, &#x442;&#x43E; &#x43E;&#x43D;&#x43E; &#x432; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C; &#x43C;&#x435;&#x43D;&#x44E; &#x43E;&#x431;&#x440;&#x435;&#x436;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C; &#x442;&#x440;&#x43E;&#x435;&#x442;&#x43E;&#x447;&#x438;&#x435; <strong>...</strong></p>
<p>&#x41E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43D;&#x438;&#x435; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x44B;&#x43C;. &#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; markdown &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; html &#x442;&#x435;&#x433;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;.</p>
<h3>&#x421;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;</h3>
<p>&#x421;&#x442;&#x438;&#x43B;&#x438; &#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x444;&#x430;&#x439;&#x43B;&#x435; <strong>assets/less/style.less</strong> &#x438; &#x43F;&#x440;&#x438; &#x437;&#x430;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x43F;&#x440;&#x435;&#x432;&#x44C;&#x44E; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x432; <strong>assets/css/style.css</strong>. &#x424;&#x430;&#x439;&#x43B; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C;, &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x43B;&#x43E;&#x433;&#x430;, &#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x441;&#x442;&#x43E;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;. &#x421;&#x442;&#x438;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x430;&#x43C;&#x43E;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; <strong>.article</strong>.</p>
<h2>&#x41F;&#x43B;&#x430;&#x43D;&#x44B;</h2>
<p>&#x418;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x438;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x431;&#x43B;&#x43E;&#x433;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x44B; &#x432; <a href="https://github.com/FeelEnergyCB/MinimalistBlog">&#x44D;&#x442;&#x43E;&#x43C;</a> github &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x441; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x435;&#x439; &#x43A;&#x430;&#x43A; &#x435;&#x439; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;.<br>
&#x412; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x438;&#x445; &#x43F;&#x43B;&#x430;&#x43D;&#x430;&#x445;:</p>
<ul>
<li>&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x438; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x434;&#x430;.</li>
<li>&#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x442;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x43B;&#x43E;&#x433;&#x430;.</li>
<li>&#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x430;.</li>
</ul>
<p>&#x415;&#x441;&#x43B;&#x438; &#x443; &#x412;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x43B;&#x438;&#x431;&#x43E; &#x438;&#x434;&#x435;&#x438;, &#x437;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &#x43C;&#x43D;&#x435; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x443; <a href="mailto:mikita.lisavets@gmail.com">mikita.lisavets@gmail.com</a>, &#x43B;&#x438;&#x431;&#x43E; &#x432; issues &#x43D;&#x430; <a href="https://github.com/FeelEnergyCB/MinimalistBlog/issues">github</a>.</p>
