<p><time>2016-07-25</time></p>
<h1>&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;</h1>
<p>&#x41F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x435;&#x43C; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x441;&#x43E;&#x431;&#x43E;&#x439; 2 &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;: <strong>ucglib</strong> &#x438; <strong>adafruit gfx</strong>.<br>
&#x41F;&#x440;&#x435;&#x434;&#x43C;&#x435;&#x442;&#x43E;&#x43C; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x432; &#x437;&#x430;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x438; &#x43F;&#x440;&#x438;&#x43C;&#x438;&#x442;&#x438;&#x432;&#x43E;&#x432;. &#x417;&#x430;&#x43C;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; arduino micros(), &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x440;&#x43E;&#x448;&#x435;&#x434;&#x448;&#x438;&#x445; &#x43C;&#x438;&#x43A;&#x440;&#x43E;&#x441;&#x435;&#x43A;&#x443;&#x43D;&#x434; &#x441; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x441;&#x442;&#x430;&#x440;&#x442;&#x430; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;.</p>
<p>&#x41D;&#x443; &#x438; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x44B;&#x43C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43B;&#x438;&#x446;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435;&#x442; TFT &#x44D;&#x43A;&#x440;&#x430;&#x43D; 1.44&quot; (128x128 &#x43F;&#x438;&#x43A;&#x441;&#x43B;&#x435;&#x439;) &#x441; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43E;&#x43C; SPI.</p>
<p>!(&#x43F;&#x438;&#x43A;&#x447;&#x430; &#x441; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x43E;&#x43C;)!</p>
<p>&#x414;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43A; <a href="https://github.com/olikraus/ucglib/wiki/reference">ucglib</a> &#x438; <a href="https://learn.adafruit.com/adafruit-gfx-graphics-library?view=all">adafruit gfx</a></p>
<h3>&#x41D;&#x435;&#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435;</h3>
<p><em>&#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; ucglib &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x437;&#x430;&#x434;&#x430;&#x435;&#x43C; &#x446;&#x432;&#x435;&#x442; &#x43A;&#x43E;&#x43C;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x439; setColor, &#x430; &#x443;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x440;&#x438;&#x441;&#x443;&#x435;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. &#x41D;&#x43E; &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x438;&#x44F;&#x445;, setColor &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44B; &#x43C;&#x438;&#x43A;&#x440;&#x43E;&#x441;&#x435;&#x43A;&#x443;&#x43D;&#x434;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x44D;&#x442;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x43D;&#x435;&#x431;&#x440;&#x435;&#x447;&#x44C;.</em></p>
<p>&#x418;&#x442;&#x430;&#x43A;, &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x43D;&#x430; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x438;&#x43A;&#x441;&#x435;&#x43B;&#x44F;:</p>
<p>!(&#x43F;&#x438;&#x43A;&#x447;&#x430; &#x441; &#x43F;&#x438;&#x43A;&#x441;&#x435;&#x43B;&#x435;&#x43C;)!</p>
<p><strong>ucglib</strong> - 580&#x43C;&#x43A;&#x441;.<br>
<strong>adafruit gfx</strong> - 404&#x43C;&#x43A;&#x441;.</p>
<p>&#x41E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x43B;&#x438;&#x43D;&#x438;&#x438;:</p>
<p>!(&#x43F;&#x438;&#x43A;&#x447;&#x430; &#x441; &#x43B;&#x438;&#x43D;&#x438;&#x435;&#x439;)!</p>
<p><strong>ucglib</strong> - 52384&#x43C;&#x43A;&#x441;.<br>
<strong>adafruit gfx</strong> - 36620&#x43C;&#x43A;&#x441;.</p>
<p><em>&#x412;&#x43E;&#x442; &#x442;&#x443;&#x442; &#x443;&#x436;&#x435; &#x433;&#x43B;&#x430;&#x437; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x43B;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x432; ~ 20&#x43C;&#x441;</em></p>
