<p><time>2016-01-09</time></p>
<h1>CSS-grid</h1>
<p>&#x41F;&#x43E; <a href="http://www.w3.org/TR/css-grid-1/">&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;</a> CSS-grid - &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; CSS, &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x434;&#x432;&#x443;&#x43C;&#x435;&#x440;&#x43D;&#x443;&#x44E; &#x441;&#x435;&#x442;&#x43A;&#x443;, &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x434;&#x43B;&#x44F; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;. &#x412; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x435;&#x442;&#x43A;&#x435; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43C;&#x43E;&#x433;&#x443; &#x431;&#x44B;&#x442;&#x44C; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x44B; &#x432; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x430;&#x445;.</p>
<p>&#x41D;&#x430; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F;&#x448;&#x43D;&#x438;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x434;&#x438;&#x438; <strong>Working Draft</strong>. &#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430; &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x443;&#x436;&#x430;&#x441;&#x43D;&#x430;: IE &#x438; EDGE &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x441;&#x442;&#x430;&#x440;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; 2011 &#x433;&#x43E;&#x434;&#x430;. Chrome, Firefox &#x438; Opera &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x444;&#x43B;&#x430;&#x433;&#x430;&#x445;, &#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x43F;&#x43E;&#x43A;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x43D;&#x435;&#x442;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x43C; Google Chrome &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x444;&#x43B;&#x430;&#x433;&#x43E;&#x43C; &quot;&#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432;&#x435;&#x431;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x44B;&quot; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; chrome://flags</p>
<h2>&#x41F;&#x440;&#x438;&#x441;&#x442;&#x443;&#x43F;&#x438;&#x43C;</h2>
<p>&#x412;&#x441;&#x435; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x431;&#x43B;&#x43E;&#x43A;&#x430; &#x43A;&#x430;&#x43A; grid &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x43C;:<br>
<code>display: grid;</code></p>
<p><a class="jsbin-embed foo" href="http://jsbin.com/iwovaj/74/embed?js,output"><br>
Simple Animation Tests</a></p>
<script src="http://static.jsbin.com/js/embed.js"></script>
