<p><time>2016-01-09</time></p>
<h1>CSS grid</h1>
<p>&#x41F;&#x43E; <a href="http://www.w3.org/TR/css-grid-1/">&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;</a> CSS-grid - &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; CSS, &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x434;&#x432;&#x443;&#x43C;&#x435;&#x440;&#x43D;&#x443;&#x44E; &#x441;&#x435;&#x442;&#x43A;&#x443;, &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x434;&#x43B;&#x44F; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;. &#x412; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x435;&#x442;&#x43A;&#x435; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x44B; &#x432; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x430;&#x445;.</p>
<p>&#x41D;&#x430; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E; 2016 &#x433;&#x43E;&#x434;&#x430; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x441;&#x442;&#x430;&#x434;&#x438;&#x438; <strong>Working Draft</strong>. &#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430; &#x43D;&#x430; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x443;&#x436;&#x430;&#x441;&#x43D;&#x430;: IE &#x438; EDGE &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x441;&#x442;&#x430;&#x440;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; 2011 &#x433;&#x43E;&#x434;&#x430;. Chrome, Firefox &#x438; Opera &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x444;&#x43B;&#x430;&#x433;&#x430;&#x445;, &#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x43F;&#x43E;&#x43A;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x43D;&#x435;&#x442;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x43C; Google Chrome &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x444;&#x43B;&#x430;&#x433;&#x43E;&#x43C; &quot;&#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432;&#x435;&#x431;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x44B;&quot; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; chrome://flags</p>
<h2>&#x41F;&#x440;&#x438;&#x441;&#x442;&#x443;&#x43F;&#x438;&#x43C;</h2>
<p>&#x41D;&#x430;&#x447;&#x43D;&#x435;&#x43C; &#x441; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x431;&#x43B;&#x43E;&#x43A;&#x430; &#x43A;&#x430;&#x43A; grid &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x43C; <strong>display</strong> &#x441;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; <strong>grid</strong> &#x438;&#x43B;&#x438; <strong>inline-grid</strong>.</p>
<p>&#x414;&#x430;&#x43B;&#x435;&#x435; &#x43C;&#x44B; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x441;&#x435;&#x442;&#x43A;&#x443; &#x44D;&#x442;&#x43E;&#x433;&#x43E; grid &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x43C;&#x438; <strong>grid-template-columns</strong> &#x438; <strong>grid-template-rows</strong>. &#x412; &#x44D;&#x442;&#x438; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x44B; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x438;&#x437; &#x43A;&#x43E;&#x43B;&#x43E;&#x43D;&#x43E;&#x43A; &#x438; &#x441;&#x442;&#x440;&#x43E;&#x43A;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;.</p>
<p>&#x415;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x430;&#x43C;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x431;&#x44B;&#x442;&#x44C;:</p>
<ul>
<li><strong>&#x43B;&#x438;&#x43D;&#x435;&#x439;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x44B;</strong> &#x2014; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x435; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44B; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x438;&#x44F;: px, %, em, rem, vw, vh &#x438; &#x442;.&#x434;.; (&#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B;&#x441;&#x43E;&#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430; &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x430;, &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442;)</li>
<li><strong>&#x434;&#x43E;&#x43B;&#x438; (fraction, fr)</strong> &#x2014; &#x43D;&#x435;&#x43E;&#x442;&#x440;&#x438;&#x446;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x434;&#x43E;&#x43B;&#x44E; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x432; grid &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x435;;</li>
<li><strong>min-content</strong> &#x2014; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x43E;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x44B;, &#x438;&#x441;&#x445;&#x43E;&#x434;&#x44F; &#x438;&#x437; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;;</li>
<li><strong>max-content</strong> &#x2014; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x43E;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x44B;, &#x438;&#x441;&#x445;&#x43E;&#x434;&#x44F; &#x438;&#x437; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;;</li>
<li><strong>minmax(min, max)</strong> &#x2014; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;, &#x437;&#x430;&#x434;&#x430;&#x44E;&#x449;&#x430;&#x44F; &#x434;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x43E;&#x442; &gt;= min &#x434;&#x43E; &lt;= max. &#x415;&#x441;&#x43B;&#x438; max &lt; min, &#x442;&#x43E; max &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x433;&#x43D;&#x43E;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; minmax(min,max) &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x432;&#x435;&#x43D; min.</li>
<li><strong>auto</strong> &#x2014; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;, &#x43F;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x443;. &#x41C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; auto &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x43E; max-content, &#x430; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x439; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;, &#x43A;&#x430;&#x43A; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x432; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F;&#x445;  min-width / min-height.</li>
</ul>
<h3>&#x41D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430; &#x441;&#x435;&#x442;&#x43A;&#x438;</h3>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43C; &#x441;&#x435;&#x442;&#x43A;&#x443;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x432;&#x441;&#x435; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44B; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x438;&#x439;, &#x43F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x43D;&#x435;&#x435; &#x432; &#x442;&#x43E;&#x43C; &#x436;&#x435; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x435;.</p>
<pre><code><span class="hljs-class">.container</span> <span class="hljs-rules">{
  <span class="hljs-rule"><span class="hljs-attribute">display</span>:<span class="hljs-value"> grid</span></span>;
  <span class="hljs-rule"><span class="hljs-attribute">grid-template-columns</span>:<span class="hljs-value"> <span class="hljs-number">100px</span> <span class="hljs-number">1</span>fr min-content max-content <span class="hljs-function">minmax</span>(min-content, <span class="hljs-number">1</span>fr) auto</span></span>;
}</span>
</code></pre>
<iframe src="http://jsbin.com/jihizor/10/edit?output" heigth="100"></iframe>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43E;&#x431;&#x44A;&#x44F;&#x432;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x441;&#x435;&#x442;&#x43A;&#x438; &#x438; &#x434;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x43C; <strong>grid-template-areas</strong>.<br>
&#x423; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x441;&#x435;&#x442;&#x43A;&#x438; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x430;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; <strong>grid-area</strong>.</p>
<pre><code><span class="hljs-class">.container</span> <span class="hljs-rules">{
  <span class="hljs-rule"><span class="hljs-attribute">display</span>:<span class="hljs-value"> grid</span></span>;
  <span class="hljs-rule"><span class="hljs-attribute">grid-template-columns</span>:<span class="hljs-value"> auto <span class="hljs-function">minmax</span>(min-content, <span class="hljs-number">1</span>fr)</span></span>;
  <span class="hljs-rule"><span class="hljs-attribute">grid-template-rows</span>:<span class="hljs-value"> auto <span class="hljs-function">minmax</span>(min-content, <span class="hljs-number">1</span>fr) <span class="hljs-function">minmax</span>(min-content, <span class="hljs-number">2</span>fr) auto</span></span>;
  <span class="hljs-rule"><span class="hljs-attribute">grid-template-areas</span>:<span class="hljs-value"> <span class="hljs-string">&quot;title stats&quot;</span>
                       <span class="hljs-string">&quot;score stats&quot;</span>
                       <span class="hljs-string">&quot;board board&quot;</span>
                       <span class="hljs-string">&quot;board board&quot;</span>
                       <span class="hljs-string">&quot;ctrls ctrls&quot;</span></span></span>;
}</span>
</code></pre>
<iframe src="http://jsbin.com/jihizor/12/edit?output" heigth="150"></iframe>
<h3>&#x41E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x441;&#x435;&#x442;&#x43A;&#x438;</h3>
<p>&#x414;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x441;&#x435;&#x442;&#x43A;&#x438; &#x442;&#x43E;&#x436;&#x435; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<ul>
<li>&#x43A;&#x430;&#x43A; &#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x432;&#x44B;&#x448;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x443; grid &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; <strong>grid-template-areas</strong>, &#x442;&#x43E; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x438;&#x437; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x43B;&#x44F; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x43C; <strong>grid-area</strong>;</li>
<li>&#x442;&#x430;&#x43A; &#x436;&#x435;, &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432; &#x43B;&#x44E;&#x431;&#x443;&#x44E; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x43C;&#x438; <strong>grid-column</strong> &#x438; <strong>grid-row</strong>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x442; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x438; &#x438; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x44F;&#x447;&#x435;&#x435;&#x43A; &#x438;&#x43B;&#x438; &#x441;&#x442;&#x440;&#x43E;&#x43A;, &#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F;:</li>
</ul>
<pre><code>  <span class="hljs-rule"><span class="hljs-attribute">grid-column</span>:<span class="hljs-value"> <span class="hljs-number">1</span> / span <span class="hljs-number">2</span></span></span>;
  <span class="hljs-rule"><span class="hljs-attribute">grid-row</span>:<span class="hljs-value"> <span class="hljs-number">1</span> / span <span class="hljs-number">2</span></span></span>;
</code></pre>
<p>&#x433;&#x434;&#x435; &apos;2&apos; - &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x435;&#x43C;&#x44B;&#x445; &#x44F;&#x447;&#x435;&#x435;&#x43A; &#x438;&#x43B;&#x438; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;.</p>
<ul>
<li>&#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; <strong>justify-self</strong> &#x438; <strong>align-self</strong> &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x438;&#x440;&#x443;&#x44E;&#x442; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x438; &#x441;&#x435;&#x442;&#x43A;&#x438; &#x43F;&#x43E; &#x432;&#x435;&#x440;&#x442;&#x438;&#x43A;&#x430;&#x43B;&#x438; &#x438; &#x433;&#x43E;&#x440;&#x438;&#x437;&#x43E;&#x43D;&#x442;&#x430;&#x43B;&#x438; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;:</li>
</ul>
<iframe src="http://jsbin.com/jihizor/13/edit?output" heigth="150"></iframe>
<h2>&#x417;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;</h2>
<p>&#x41D;&#x430; &#x43C;&#x43E;&#x439; &#x432;&#x437;&#x433;&#x43B;&#x44F;&#x434; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; CSS3 Grid Layout &#x44D;&#x442;&#x43E; &#x43D;&#x43E;&#x432;&#x430;&#x44F; &#x432;&#x435;&#x445;&#x430; &#x432; &#x440;&#x430;&#x437;&#x432;&#x438;&#x442;&#x438;&#x438; CSS. &#x42D;&#x442;&#x43E;&#x442; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435; &#x43A;&#x43E;&#x43D;&#x446;&#x43E;&#x432; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x442; &#x43A;&#x43E;&#x43D;&#x435;&#x446; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x43C; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x439; &#x432;&#x438;&#x434; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446; &#x43D;&#x430; &#x434;&#x435;&#x441;&#x43A;&#x442;&#x43E;&#x43F;&#x435; &#x438; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445;, &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x431;&#x435;&#x433;&#x430;&#x44F; &#x43A; &#x43C;&#x430;&#x43D;&#x438;&#x43F;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x441; html &#x440;&#x430;&#x437;&#x43C;&#x435;&#x442;&#x43A;&#x43E;&#x439;.</p>
<p>&#x41D;&#x43E; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x44B;&#x439; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441; &#x43E;&#x441;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x43C; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C;&#x438;, &#x447;&#x442;&#x43E; &#x438; &#x43E;&#x442;&#x442;&#x430;&#x43B;&#x43A;&#x438;&#x432;&#x430;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x432; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x441; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x43C;.</p>
