<p><time>2015-09-11</time></p>
<h1>&#x41F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x44B; &#x432; CSS</h1>
<p>&#x421;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; CSS3 &#x432;&#x441;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x43E;&#x440;&#x43C;&#x43E;&#x439; &#x431;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x430;&#x440;&#x44F; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x430;&#x44E;&#x449;&#x435;&#x439;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x432;, &#x447;&#x442;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C;. &#x422;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x438;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x449;&#x438;&#x43A;&#x43E;&#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x435;&#x440;&#x432;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x44F;&#x442;&#x441;&#x44F; &#x43A; &#x432;&#x43D;&#x435;&#x434;&#x440;&#x435;&#x43D;&#x438;&#x44E; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x434;&#x430; &#x432;&#x43A;&#x443;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432; &#x43F;&#x43E;&#x432;&#x441;&#x435;&#x434;&#x43D;&#x435;&#x432;&#x43D;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x442;&#x43A;&#x443;. &#x418; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x438;&#x437; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x448;&#x442;&#x443;&#x43A; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; <strong>CSS3 Selectors</strong>.</p>
<p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x437;&#x430;&#x447;&#x430;&#x441;&#x442;&#x443;&#x44E; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E;, &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x431;&#x43E; n-&#x433;&#x43E; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x435;&#x433;&#x43E; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x43D;&#x43E; &#x442;&#x430;&#x43C; &#x435;&#x441;&#x442;&#x44C; &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439;.</p>
<p>&#x417;&#x430;&#x431;&#x435;&#x433;&#x430;&#x44F; &#x432;&#x43F;&#x435;&#x440;&#x435;&#x434; &#x445;&#x43E;&#x447;&#x443; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x443; &#x441;&#x43B;&#x43E;&#x432; &#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x43E; &#x447;&#x435;&#x43C; &#x44F; &#x431;&#x443;&#x434;&#x443; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435;. &#x41E;&#x43D;&#x430; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x430;&#x44F;: <strong>ie9+</strong> ( &#x432; 7 &#x438; 8 &#x447;&#x430;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x430;&#x44F;, &#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x435;&#x441;&#x442;&#x44C; js-&#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43E; <a href="http://selectivizr.com/">selectivizr</a> &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; ), <strong>FF 3.5+, Crome 4+, Safari 3.2+, Opera 9.6+</strong> &#x438; <strong>&#x432;&#x441;&#x435;</strong> &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x44B;. &#x41D;&#x443; &#x430; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x447;&#x443;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x43E; CSS3 &#x441;&#x435;&#x43B;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x445;:</p>
<h2>&#x418;&#x43D;&#x433;&#x440;&#x435;&#x434;&#x438;&#x435;&#x43D;&#x442;&#x44B;</h2>
<table>
<thead>
<tr><th></th><th></th></tr>
</thead>
<tbody>
<tr><td><strong>:checked</strong></td><td>&#x421; &#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43C;&#x44B;, &#x432; html-&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x435;, &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; checkbox &#x438; radio &#x432; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438; checked.</td></tr>
<tr><td><strong>:default</strong></td><td>&#x421; &#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x438;&#x43B;&#x44C; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x43E;&#x439; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;. <br> <em>&#xAB;&#x41F;&#x43E;-&#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;&#xBB; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; input &#x441; &#x442;&#x438;&#x43F;&#x43E;&#x43C; submit &#x432; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x442;&#x43A;&#x435;.</em></td></tr>
<tr><td><strong>:disabled</strong> <strong>:enabled</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; disabled &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x432;&#x44B;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438;. &#x421;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441; enabled &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438;.</td></tr>
<tr><td><strong>:empty</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442; &#x432; &#x441;&#x435;&#x431;&#x435; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x438;&#x43B;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;.</td></tr>
<tr><td><strong>:first-of-type</strong> <strong>:last-of-type</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x432; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x432; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x435; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. <br> <em>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;, &#x430; &#x43D;&#x435; &#x43A; &#x440;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x43C;&#x443; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;.</em></td></tr>
<tr><td><strong>:indeterminate</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x43C;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; checkbox, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x43D;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438;. <br> <em>&#xAB;&#x41D;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#xBB; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; javascript &#x43A;&#x43E;&#x434;&#x430;.</em></td></tr>
<tr><td><strong>:valid</strong> <strong>:invalid</strong></td><td>&#x42D;&#x442;&#x438; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x43D;&#x44B;&#x43C; &#x438; &#x43D;&#x435; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x43D;&#x44B;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; &#x444;&#x43E;&#x440;&#x43C;, &#x443; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x43D; &#x442;&#x438;&#x43F; (url, email, number, etc.)</td></tr>
<tr><td><strong>:first-child</strong> <strong>:last-child</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x438;&#x445; &#x434;&#x432;&#x443;&#x445; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x432; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C;&#x443; &#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x43C;&#x443; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x435;&#x43C;&#x443; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. <br> <em>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x440;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x43C;&#x443; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;.</em></td></tr>
<tr><td><strong>:not</strong></td><td>&#x41F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441; not &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x431;&#x435; &#x441;&#x435;&#x43B;&#x435;&#x43A;&#x442;&#x43E;&#x440;. <br>:not(h1) &#x2014; &#x432;&#x441;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; <br> h1 input:not([type=&#x2019;button&#x2019;]) &#x2014; &#x432;&#x441;&#x435; input, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; button</td></tr>
<tr><td><strong>:nth-of-child</strong></td><td>&#x42D;&#x442;&#x43E;&#x442; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; &#x43F;&#x43E; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44E; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432; &#x434;&#x435;&#x440;&#x435;&#x432;e DOM. <br> <em>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;.</em> <br> odd &#x2014; &#x43D;&#x435;&#x447;&#x435;&#x442;&#x43D;&#x44B;&#x439; <br> even &#x2014; &#x447;&#x435;&#x442;&#x43D;&#x44B;&#x439;</td></tr>
<tr><td><strong>:nth-of-last-child</strong></td><td>&#x410;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x43E; nth-of-child, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x43A;&#x430; &#x438;&#x434;&#x435;&#x442; &#x441; &#x43A;&#x43E;&#x43D;&#x446;&#x430; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430; DOM.</td></tr>
<tr><td><strong>:nth-of-type</strong></td><td>&#x41E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x43E;&#x442; nth-of-child &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x438;&#x442; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; nth-of-type &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x442;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x44D;&#x442;&#x438;&#x43C; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x43C;, &#x430; nth-of-child &#x436;&#x435; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442; &#x432;&#x441;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442; &#x441;&#x442;&#x438;&#x43B;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43D;&#x43E;&#x43C;&#x443;. <br></td></tr>
<tr><td></td><td><code>&lt;p&gt;Paragraph 1&lt;/p&gt;</code> <br> <code>&lt;h1&gt;Header&lt;/h1&gt;</code> <br> <code>&lt;p&gt;Paragraph 2&lt;/p&gt;</code></td></tr>
<tr><td></td><td>p:nth-of-child(2) &#x2014; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x43D;&#x438; &#x43A; &#x43A;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;. <br> p:nth-of-type(2) &#x2014; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x43A; 2-&#x43C;&#x443; &#x43F;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x443;.</td></tr>
<tr><td><strong>:only-child</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</td></tr>
<tr><td><strong>:optional</strong> <strong>:required</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x444;&#x43E;&#x440;&#x43C;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x438;&#x43B;&#x438; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. <br> <em>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; required.</em></td></tr>
<tr><td><strong>:read-only</strong> <strong>:read-write</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; read-only &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; readonly, &#x430; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; read-write, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C;.</td></tr>
<tr><td><strong>:root</strong></td><td>&#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; root &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x43C; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443; &#x43D;&#x430; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; html</td></tr>
</tbody>
</table>
<h2>&#x418; &#x43D;&#x430; &#x441;&#x43B;&#x430;&#x434;&#x43A;&#x43E;&#x435;</h2>
<p><strong>div[class^=&#x2019;some&#x2019;]</strong> &#x2014; &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; div, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; class &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#xAB;some&#xBB;<br>
<strong>div[class$=&#x2019;some&#x2019;]</strong> &#x2014; &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; div, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; class &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43A;&#x430;&#x43D;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442; &#xAB;some&#xBB;<br>
<strong>div[class*=&#x2019;some&#x2019;]</strong> &#x2014; &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; div, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; class &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x442;&#x435;&#x43A;&#x441;&#x442; &#xAB;some&#xBB;<br>
<strong>div[class~=&#x2019;some&#x2019;]</strong> &#x2014; &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; div, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; class &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x442;&#x435;&#x43A;&#x441;&#x442; &#xAB;some&#xBB;, &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x431;&#x435;&#x43B;&#x43E;&#x43C;<br>
<strong>div[class|=&#x2019;some&#x2019;]</strong> &#x2014; &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; div, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; class &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x442;&#x435;&#x43A;&#x441;&#x442; &#xAB;some&#xBB;, &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x442;&#x438;&#x440;&#x435;</p>
<p><strong>div p</strong> &#x2014; &#x423;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x432;&#x441;&#x435; p &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; div &#x43F;&#x440;&#x438; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435; &#x432;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438;<br>
<strong>div &gt; p</strong> &#x2014; &#x423;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x435;&#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x430; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; p div&#x2019;&#x430;<br>
<strong>div + p</strong> &#x2014; &#x423;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; p &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x43D;&#x435;&#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435; div<br>
<strong>div ~ p</strong> &#x2014; &#x423;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x432;&#x441;&#x435; p &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; div</p>
