<p><time>2016-06-22</time></p>
<h1>USB-Midi &#x41A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440; &#x43D;&#x430; Arduino</h1>
<p>&#x41F;&#x43E;&#x43C;&#x438;&#x43C;&#x43E; &#x432;&#x435;&#x431; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x43C;&#x43E;&#x438;&#x43C; &#x445;&#x43E;&#x431;&#x431;&#x438; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43E;&#x447;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43A;&#x442;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x43C;&#x443;&#x437;&#x44B;&#x43A;&#x438;. &#x41E;&#x447;&#x435;&#x43D;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x431;&#x44B;&#x432;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x440;&#x443;&#x43A;&#x438; &#x437;&#x430;&#x43D;&#x44F;&#x442;&#x44B; &#x43C;&#x443;&#x437;&#x44B;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x44C; &#x438;&#x43B;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x43C;&#x438; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x430;&#x43C;&#x438;. &#x418; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x43E;&#x43C; &#x438;&#x437; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x439; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; midi &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43D;&#x43E;&#x433;&#x430;&#x43C;&#x438; =). &#x412; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x435; &#x44F; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x436;&#x443; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x438; &#x43D;&#x435;&#x434;&#x43E;&#x440;&#x43E;&#x433;&#x43E;.</p>
<h2>&#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</h2>
<p>&#x42F; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x443; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x442;&#x435;&#x445; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;:</p>
<ul>
<li>1 &#x434;&#x43E;&#x441;&#x43A;&#x430; &#x43B;&#x430;&#x43C;&#x438;&#x43D;&#x430;&#x442;&#x430;</li>
<li>1 &#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x443;&#x433;&#x43E;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x434;&#x435;&#x440;&#x435;&#x432;&#x44F;&#x43D;&#x43D;&#x44B;&#x439; &#x431;&#x440;&#x443;&#x441;&#x43E;&#x43A;</li>
<li>&#x41A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438;</li>
<li>&#x41F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x430; &#x438; &#x438;&#x437;&#x43E;&#x43B;&#x44F;&#x446;&#x438;&#x44F; &#x43A; &#x43D;&#x438;&#x43C;</li>
<li>Arduino Uno</li>
</ul>
<p>&#x420;&#x435;&#x43F;&#x43B;&#x438;&#x43A;&#x430; arduino &#x43F;&#x43E;&#x434;&#x43E;&#x439;&#x434;&#x435;&#x442; &#x43B;&#x44E;&#x431;&#x430;&#x44F;, &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x435; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x431;&#x44B;&#x43B; &#x441; &#x447;&#x438;&#x43F;&#x43E;&#x43C; <strong>ATmega16U2</strong> &#x438;&#x43B;&#x438; <strong>8u2</strong>, &#x43D;&#x43E; &#x43D;&#x435; <strong>CH340 (CH341)</strong>.</p>
<p><img src="posts/images/midi/0.jpg" alt=""></p>
<p>&#x418;&#x437; &#x43F;&#x43E;&#x434;&#x440;&#x443;&#x447;&#x43D;&#x44B;&#x445; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43F;&#x43E;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x44F;&#x442;&#x441;&#x44F; &#x43D;&#x43E;&#x436;&#x43E;&#x432;&#x43A;&#x430;, &#x43A;&#x430;&#x43D;&#x446;&#x435;&#x43B;&#x44F;&#x440;&#x441;&#x43A;&#x438;&#x439; &#x43D;&#x43E;&#x436;, &#x43F;&#x430;&#x44F;&#x43B;&#x44C;&#x43D;&#x438;&#x43A; &#x438; &#x43A;&#x43B;&#x435;&#x439; (&#x438;&#x43B;&#x438; &#x441;&#x430;&#x43C;&#x43E;&#x440;&#x435;&#x437;&#x44B;) &#x434;&#x43B;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;.</p>
<h2>&#x41F;&#x43E;&#x434;&#x433;&#x43E;&#x442;&#x43E;&#x432;&#x43A;&#x430; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x43E;&#x432;</h2>
<p>&#x41F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x431;&#x44B;&#x43B; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43B;&#x430;&#x43C;&#x438;&#x43D;&#x430;&#x442;, &#x430; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x43A;&#x430; &#x438;&#x43B;&#x438; &#x43B;&#x438;&#x441;&#x442; &#x444;&#x430;&#x43D;&#x435;&#x440;&#x44B;? &#x41E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x43D;&#x435; &#x438;&#x43C;&#x435;&#x44F; &#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x448;&#x443;&#x440;&#x443;&#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442; &#x438;&#x43B;&#x438; &#x434;&#x440;&#x435;&#x43B;&#x44C;, &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x432;&#x435;&#x440;&#x441;&#x442;&#x438;&#x44F; &#x432; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x442;&#x432;&#x435;&#x440;&#x434;&#x44B;&#x445; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x430;&#x445;. &#x410; &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43B;&#x430;&#x43C;&#x438;&#x43D;&#x430;&#x442; &#x44D;&#x442;&#x43E; &#x43F;&#x43E; &#x441;&#x443;&#x442;&#x438; &#x414;&#x412;&#x41F;, &#x442;&#x43E; &#x438; &#x43E;&#x442;&#x432;&#x435;&#x440;&#x441;&#x442;&#x438;&#x44F; &#x43F;&#x43E;&#x434; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x43C; &#x43A;&#x430;&#x43D;&#x446;&#x435;&#x43B;&#x44F;&#x440;&#x441;&#x43A;&#x438;&#x43C; &#x43D;&#x43E;&#x436;&#x43E;&#x43C;.</p>
<p>&#x41F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x448;&#x430;&#x433;&#x43E;&#x43C; &#x43E;&#x442;&#x43C;&#x435;&#x440;&#x44F;&#x435;&#x43C; &#x438; &#x43E;&#x442;&#x440;&#x435;&#x437;&#x430;&#x435;&#x43C; &#x43D;&#x430; &#x43B;&#x438;&#x441;&#x442;&#x435; &#x43B;&#x430;&#x43C;&#x438;&#x43D;&#x430;&#x442;&#x430; 2 &#x43E;&#x442;&#x440;&#x435;&#x437;&#x43E;&#x43A; 50 x 20&#x441;&#x43C;, &#x430; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x434;&#x435;&#x43B;&#x438;&#x43C; &#x434;&#x435;&#x440;&#x435;&#x432;&#x44F;&#x43D;&#x43D;&#x44B;&#x439; &#x431;&#x440;&#x443;&#x441;&#x43E;&#x43A; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x43E;&#x439; 20&#x441;&#x43C; &#x43D;&#x430;&#x438;&#x441;&#x43A;&#x43E;&#x441;&#x43E;&#x43A;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x43E;&#x441;&#x44C; 2 &#x442;&#x440;&#x435;&#x443;&#x433;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43A;&#x43B;&#x43E;&#x43D;&#x430; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x44B;.<br>
<img src="posts/images/midi/1.jpg" alt=""></p>
<p>&#x414;&#x430;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x447;&#x430;&#x435;&#x43C; &#x43D;&#x430; &#x440;&#x430;&#x432;&#x43D;&#x44B;&#x445; &#x440;&#x430;&#x441;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;&#x445; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43D;&#x43E;&#x43F;&#x43E;&#x43A;, &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x44F; &#x43E;&#x442;&#x441;&#x442;&#x443;&#x43F;&#x44B; &#x441; &#x434;&#x432;&#x443;&#x445; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D; &#x448;&#x438;&#x440;&#x438;&#x43D;&#x443; &#x43D;&#x430;&#x43A;&#x43B;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x431;&#x440;&#x443;&#x441;&#x43A;&#x43E;&#x432;.<br>
<img src="posts/images/midi/2.jpg" alt=""></p>
<p>&#x41E;&#x442;&#x43C;&#x435;&#x447;&#x430;&#x435;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x44B;&#x439; &#x434;&#x438;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x43E;&#x442;&#x432;&#x435;&#x440;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x43E;&#x434; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438;.<br>
<img src="posts/images/midi/3.jpg" alt=""></p>
<p>&#x421;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x448;&#x430;&#x433;&#x43E;&#x43C; &#x441;&#x432;&#x435;&#x440;&#x43B;&#x438;&#x43C; (&#x438;&#x43B;&#x438; &#x43A;&#x43E;&#x432;&#x44B;&#x440;&#x44F;&#x435;&#x43C; &#x43A;&#x430;&#x43A; &#x432; &#x43C;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;) &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x44B;&#x435; &#x43E;&#x442;&#x432;&#x435;&#x440;&#x441;&#x442;&#x438;&#x44F;. &#x41A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x436;&#x435; &#x441;&#x43E;&#x432;&#x435;&#x442;&#x443;&#x44E; &#x43F;&#x440;&#x438;&#x43E;&#x431;&#x440;&#x435;&#x442;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x43A;&#x440;&#x435;&#x43F;&#x447;&#x435;, &#x43D;&#x435;&#x436;&#x435;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; &#x43A;&#x430;&#x43A; &#x43D;&#x430; &#x444;&#x43E;&#x442;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43A;&#x430;&#x43A; &#x432; &#x433;&#x438;&#x442;&#x430;&#x440;&#x43D;&#x44B;&#x445; &#x43F;&#x435;&#x434;&#x430;&#x43B;&#x44F;&#x445; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x43E;&#x432;.<br>
<img src="posts/images/midi/4.jpg" alt=""></p>
<p>&#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x44F; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; 2 &#x440;&#x44F;&#x434;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43E;&#x43A; &#x43F;&#x43E; 5 &#x448;&#x442;&#x443;&#x43A; &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;.<br>
<img src="posts/images/midi/5.jpg" alt=""></p>
<p>&#x41D;&#x443; &#x438; &#x43C;&#x43E;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43C; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x438;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x430;.</p>
<p><img src="posts/images/midi/6.jpg" alt=""><br>
<img src="posts/images/midi/7.jpg" alt=""></p>
<h2>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43D;&#x43E;&#x435; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435;</h2>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; arduino uno &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x441;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x441;&#x440;&#x435;&#x434;&#x43E;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; Arduino IDE.</p>
<h3>&#x41A;&#x43E;&#x434;</h3>
<pre><code><span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;MIDI.h&gt;</span></span>

MIDI_CREATE_DEFAULT_INSTANCE();
<span class="hljs-preprocessor">#<span class="hljs-keyword">define</span> BTNS_COUNT <span class="hljs-number">10</span></span>
<span class="hljs-preprocessor">#<span class="hljs-keyword">define</span> SHIFT_NOTES <span class="hljs-number">36</span></span>
<span class="hljs-keyword">int</span> momentaryBtns[BTNS_COUNT] = {<span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, A0, A1, A2, A3, A4};
boolean momentaryState[BTNS_COUNT];

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">setup</span><span class="hljs-params">()</span> </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>; i &lt; BTNS_COUNT; i++) {
      pinMode(momentaryBtns[i], INPUT_PULLUP);
    };
    MIDI.begin(<span class="hljs-number">4</span>);
}

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">loop</span><span class="hljs-params">()</span> </span>{  
  readButtons();
  delay(<span class="hljs-number">20</span>);
}

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">readButtons</span><span class="hljs-params">()</span> </span>{
  <span class="hljs-keyword">int</span> momentary, toggle;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>; i &lt; BTNS_COUNT; i++) {
    momentary = digitalRead(momentaryBtns[i]);
    <span class="hljs-keyword">if</span> (momentary == <span class="hljs-number">0</span>) {
      <span class="hljs-keyword">if</span> (momentaryState[i] != <span class="hljs-literal">true</span>) {
        MIDI.sendNoteOn(SHIFT_NOTES + i,<span class="hljs-number">127</span>,<span class="hljs-number">1</span>);
        momentaryState[i] = <span class="hljs-literal">true</span>;
      }
    } <span class="hljs-keyword">else</span> {
      <span class="hljs-keyword">if</span> (momentaryState[i] == <span class="hljs-literal">true</span>) {
        MIDI.sendNoteOff(SHIFT_NOTES + i,<span class="hljs-number">0</span>,<span class="hljs-number">1</span>);
      }
      momentaryState[i] = <span class="hljs-literal">false</span>;
    }
  };
}
</code></pre>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x432;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x448;&#x438;&#x442;&#x44C; arduino. &#x418;&#x437; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430; <a href="https://github.com/ddiakopoulos/hiduino/tree/master/compiled_firmwares">hiduino</a> &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x441;&#x43A;&#x430;&#x447;&#x430;&#x442;&#x44C; 2 &#x43F;&#x440;&#x43E;&#x448;&#x438;&#x432;&#x43A;&#x438;: arduino_midi.hex &#x438; usbserial_uno_16u2.hex (&#x438;&#x43B;&#x438; usbserial_uno_8u2.hex &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x447;&#x438;&#x43F;&#x430;).</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x448;&#x438;&#x432;&#x43A;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C; arduino &#x43A; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x443;, &#x434;&#x430;&#x43B;&#x435;&#x435; &#x437;&#x430;&#x43C;&#x43A;&#x43D;&#x443;&#x442;&#x44C; 2 &#x43A;&#x43E;&#x43D;&#x442;&#x430;&#x43A;&#x442;&#x430; (&#x441;&#x43C;. &#x440;&#x438;&#x441;&#x443;&#x43D;&#x43E;&#x43A; &#x43D;&#x438;&#x436;&#x435;) &#x438; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B;.</p>
<p><img src="posts/images/midi/8.jpg" alt=""></p>
<pre><code>sudo dfu-programmer atmega16u2 erase

sudo dfu-programmer atmega16u2 flash arduino_midi<span class="hljs-class">.hex</span>
&#x438;&#x43B;&#x438;
sudo dfu-programmer atmega16u2 flash usbserial_uno_16u2<span class="hljs-class">.hex</span> --suppress-bootloader-mem
<span class="hljs-comment">// &#x434;&#x43B;&#x44F; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x442;&#x430; &#x43A; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x448;&#x438;&#x432;&#x43A;&#x435;</span>

sudo dfu-programmer atmega16u2 reset
</code></pre>
<h2>&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x430;</h2>
<p>&#x41D;&#x443; &#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x439; &#x44D;&#x442;&#x430;&#x43F; &#x44D;&#x442;&#x43E; &#x43F;&#x430;&#x439;&#x43A;&#x430; &#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C;. &#x421;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x44B; &#x43A;&#x43D;&#x43E;&#x43F;&#x43E;&#x43A; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430;&#x43C;:<br>
2, 3, 4, 5, 6 - &#x43D;&#x438;&#x436;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;.<br>
A0, A1, A2, A3, A4 - &#x432;&#x435;&#x440;&#x445;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;.<br>
&#x412;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43A;&#x43E;&#x43D;&#x442;&#x430;&#x43A;&#x442;&#x43E;&#x43C; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x44B; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x438; &#x438;&#x434;&#x443;&#x442; &#x43D;&#x430; &#x432;&#x44B;&#x432;&#x43E;&#x434; &#x437;&#x435;&#x43C;&#x43B;&#x438; arduino.<br>
<img src="posts/images/midi/9.jpg" alt=""><br>
<img src="posts/images/midi/10.jpg" alt=""><br>
<img src="posts/images/midi/11.jpg" alt=""><br>
&#x410;rduino &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x435;&#x438;&#x432;&#x430;&#x435;&#x43C; (&#x438;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x438;&#x43D;&#x447;&#x438;&#x432;&#x430;&#x435;&#x43C;) &#x43A; &#x43A;&#x440;&#x430;&#x44E; &#x434;&#x43E;&#x441;&#x43A;&#x438;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x431;&#x44B;&#x43B;&#x43E; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; usb &#x43A;&#x430;&#x431;&#x435;&#x43B;&#x44C;. &#x422;&#x430;&#x43A; &#x436;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x435;&#x43C; c &#x43D;&#x430;&#x43A;&#x43B;&#x43E;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x431;&#x440;&#x443;&#x441;&#x43A;&#x430;&#x43C;&#x438; &#x438; &#x43D;&#x438;&#x436;&#x43D;&#x435;&#x439; &#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;.<br>
<img src="posts/images/midi/12.jpg" alt=""></p>
<h2>&#x417;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;</h2>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x43C; &#x43D;&#x435;&#x434;&#x43E;&#x440;&#x43E;&#x433;&#x43E;&#x439; usb-midi &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440; &#x43D;&#x430; &#x431;&#x430;&#x437;&#x435; arduino, &#x43D;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x43C;&#x430;&#x43F;&#x438;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x432;&#x430;&#x43C;&#x438; DAW.<br>
<img src="posts/images/midi/13.jpg" alt=""></p>
