<p><time>2015-09-10</time></p>
<h1>&#x41D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x445;</h1>
<p>&#x418;&#x442;&#x430;&#x433; &#x431;&#x43B;&#x43E;&#x433;. &#x41C;&#x43E;&#x44F; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x441; &#x431;&#x43B;&#x43E;&#x433;&#x430;&#x43C;&#x438; &#x43D;&#x430;&#x43F;&#x43E;&#x43C;&#x438;&#x43D;&#x430;&#x435;&#x43C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x441; &#x435;&#x436;&#x435;&#x434;&#x43D;&#x435;&#x432;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;, &#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43B;&#x44E;&#x431;&#x43B;&#x44E; &#x441;&#x432;&#x435;&#x436;&#x438;&#x435; &#x438; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x43E; &#x431;&#x435;&#x43B;&#x44B;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x430; &quot;&#x432;&#x441;&#x435; &#x441; &#x447;&#x438;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x441;&#x442;&#x430;&quot; &#x418;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x443;&#x436;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44B;&#x445; &#x431;&#x43B;&#x43E;&#x433;&#x43E;&#x432;, &#x43D;&#x43E; &#x43E;&#x43D;&#x438; &#x432;&#x441;&#x435; &#x437;&#x430;&#x431;&#x44B;&#x442;&#x44B; &#x438; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x44F; &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x440;&#x430;&#x437; &#x43D;&#x435;&#x443;&#x441;&#x442;&#x43E;&#x44F;&#x43B;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x435;&#x432;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x447;&#x438;&#x441;&#x442;&#x44B;&#x43C; &#x438; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x43E;&#x43C; &#x431;&#x43B;&#x43E;&#x433;&#x430;. &#x42D;&#x442;&#x43E;&#x442; &#x431;&#x43B;&#x43E;&#x433; &#x43D;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x442;&#x44D;&#x433;&#x43E;&#x432;, &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x438;&#x439;, &#x438; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442; &#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438;:&#x43F;&#x438;&#x448;&#x438;-&#x437;&#x430;&#x43A;&#x438;&#x434;&#x44B;&#x432;&#x430;&#x439;. &#x418; &#x44D;&#x442;&#x43E; &#x435;&#x433;&#x43E; &#x444;&#x438;&#x448;&#x43A;&#x430; &#x438; &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x435;&#x43C;&#x443; &#x437;&#x430;&#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x430;&#x442;&#x44C; &#x448;&#x430;&#x43D;&#x441;. &#x41E; &#x447;&#x435;&#x43C; &#x43E;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442;? &#x43D;&#x443; &#x44D;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x43E; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x435; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43E;-&#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x43C;&#x443; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;&#x435;. &#x410; &#x43F;&#x43E;&#x43A;&#x430; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x441;&#x442;&#x435; &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x431;&#x44B; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x43C;&#x443; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x44B;&#x445; &#x447;&#x438;&#x441;&#x442;&#x44B;&#x445; &#x431;&#x435;&#x43B;&#x44B;&#x445; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;.</p>
<p><img src="posts/images/fun.jpg" alt="&#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x44C;" title="&#x43F;&#x43E;&#x434;"></p>
