<p><time>2016-10-16</time></p>
<h1>Pomodoro &#x442;&#x430;&#x439;&#x43C;&#x435;&#x440; &#x43D;&#x430; arduino</h1>
<p>&#x412; &#x440;&#x430;&#x43C;&#x43A;&#x430;&#x445; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x44F; &#x43E;&#x43F;&#x438;&#x448;&#x443; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x439; &#x442;&#x430;&#x439;&#x43C;&#x435;&#x440; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; arduino &#x434;&#x43B;&#x44F; time management &#x442;&#x435;&#x445;&#x43D;&#x438;&#x43A;&#x438; <a href="https://en.wikipedia.org/wiki/Pomodoro_Technique">Pomodoro</a>.</p>
<h2>&#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</h2>
<p>&#x414;&#x43B;&#x44F; &#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x43A;&#x438; &#x43D;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x44F;&#x442;&#x441;&#x44F;:</p>
<ul>
<li>Arduino. &#x412; &#x43C;&#x43E;&#x435;&#x43C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x435; &#x44D;&#x442;&#x43E; Arduino nano, &#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x432;&#x438;&#x434;. &#x412;&#x441;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43E;&#x442; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x438;&#x442;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;.</li>
<li>&#x422;&#x430;&#x43A;&#x442;&#x43E;&#x432;&#x430;&#x44F; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x430;</li>
<li>6 &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x43E;&#x432;. &#x426;&#x432;&#x435;&#x442;&#x430; &#x43D;&#x435; &#x441;&#x442;&#x43E;&#x43B;&#x44C; &#x432;&#x430;&#x436;&#x43D;&#x44B;, &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x435; &#x447;&#x442;&#x43E;&#x431;&#x44B; 4 &#x438;&#x437; &#x43D;&#x438;&#x445; &#x431;&#x44B;&#x43B;&#x438; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x44B;&#x435;.</li>
<li>6 &#x440;&#x435;&#x437;&#x438;&#x441;&#x442;&#x43E;&#x440;&#x43E;&#x432; (200 - 330 &#x41E;&#x43C;).</li>
<li>&#x41F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x430;</li>
<li>&#x41F;&#x43B;&#x430;&#x442;&#x430;, &#x433;&#x434;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43A;&#x440;&#x435;&#x43F;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;.</li>
</ul>
<h3>&#x421;&#x445;&#x435;&#x43C;&#x430; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F;</h3>
<p><img src="posts/images/pomodoro/1.jpg" alt=""><br>
<a href="https://circuits.io/circuits/2956930-pomodoro-timer">&#x421;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; circuits.io</a>.</p>
<h3>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43D;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C;</h3>
<p>&#x412; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x438;&#x436;&#x435; &#x43A;&#x43E;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x448;&#x438;&#x432;&#x43A;&#x438; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x44B; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x432;&#x430;&#x43B;:<br>
&#x412;&#x440;&#x435;&#x43C;&#x44F; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; pomodoro - 25 &#x43C;&#x438;&#x43D;&#x443;&#x442;.<br>
&#x412;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x43E;&#x433;&#x43E; &#x438; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; 5 &#x438; 15 &#x43C;&#x438;&#x43D;&#x443;&#x442;.<br>
&#x41E;&#x43D;&#x438; &#x437;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; <strong>pomodorTime</strong>, <strong>shortBreak</strong> &#x438; <strong>longBreak</strong>.</p>
<p>&#x41F;&#x43E;&#x440;&#x442;&#x44B; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x43E;&#x432; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x44B; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x441; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x43E;&#x439; &#x428;&#x418;&#x41C;, &#x434;&#x43B;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x432;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435;.</p>
<p>&#x410;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x442;&#x430;&#x439;&#x43C;&#x435;&#x440;&#x430;:</p>
<ol>
<li>&#x41F;&#x440;&#x438; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x432;&#x441;&#x435;&#x445; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x43E;&#x432; &#x438; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x44F; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438;.</li>
<li>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x44F; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x441;&#x447;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; pomodoro. &#x412;&#x440;&#x435;&#x43C;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; 4 &#x43A;&#x440;&#x430;&#x441;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x430;. &#x41D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x435; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x434;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x44F; pomodoro &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x435;&#x442; &#x441;&#x431;&#x440;&#x43E;&#x441; &#x43E;&#x442;&#x441;&#x447;&#x435;&#x442;&#x430;.</li>
<li>&#x41F;&#x43E; &#x438;&#x441;&#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44E; &#x43E;&#x442;&#x441;&#x447;&#x435;&#x442;&#x430; pomodoro, &#x43C;&#x438;&#x433;&#x430;&#x44E;&#x449;&#x438;&#x435; &#x43A;&#x440;&#x430;&#x441;&#x43D;&#x44B;&#x435; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x44B; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x44F;&#x442; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x445;, &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, pomodoro &#x432; &#x434;&#x432;&#x43E;&#x438;&#x447;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; &#x441;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x438;&#x44F;. &#x41C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x445; pomodoro - 15 (1111). &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x447;&#x435;&#x442;&#x447;&#x438;&#x43A; &#x441;&#x431;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x441;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;.</li>
<li>&#x41F;&#x43E; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x44E; &#x43D;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443; &#x442;&#x430;&#x439;&#x43C;&#x435;&#x440; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x434;&#x435;&#x442; &#x432; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x445; 3-&#x445; pomodoro - &#x432; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;. &#x41F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x441;&#x44F; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434; &#x438; &#x43D;&#x430;&#x447;&#x43D;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x441;&#x447;&#x435;&#x442; &#x43F;&#x43E; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x443; &#x448;&#x430;&#x433;&#x443; 2. &#x41D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x435; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x434;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430; &#x43D;&#x438; &#x43A; &#x447;&#x435;&#x43C;&#x443; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x442;.</li>
<li>&#x41F;&#x43E; &#x438;&#x441;&#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;, &#x43C;&#x438;&#x433;&#x430;&#x44E;&#x449;&#x438;&#x435; &#x43A;&#x440;&#x430;&#x441;&#x43D;&#x44B;&#x435; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434;&#x44B; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x44F;&#x442; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x445;, &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, pomodoro. &#x41E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x441; &#x43D;&#x438;&#x43C;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43C;&#x438;&#x433;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x43E;&#x434; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x43C;&#x443; &#x442;&#x438;&#x43F;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;.</li>
</ol>
<p>&#x414;&#x430;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x43D;&#x43E;&#x432;&#x43E; &#x441; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x430; 2.<br>
<a href="https://dl.dropboxusercontent.com/u/80313909/pomodoro.ino">&#x421;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x43A;&#x43E;&#x434;</a>.</p>
<h3>&#x424;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;</h3>
<p><img src="posts/images/pomodoro/2.jpg" alt=""></p>
