[{"id":1476576000000,"date":"2016-10-16","header":"Pomodoro таймер на arduino","path":"pomodoro-timer","preview":"В рамках этой статьи я опишу как можно сделать несложный таймер с помощью arduino для time management техники Pomodoro..."},{"id":1469664000000,"date":"2016-07-28","header":"Сравнение графических библиотек","path":"comparing-tft-libraries","preview":"Попробуем сравнить между собой 2 графические библиотеки: ucglib и adafruit gfx.\nПредметом данного сравнения будет производительность, выраженная в затраченном времени на отрисовку различных объектов и примитивов. Замерять время будем при помощи стандартной функции arduino micros(), которая возвращает количество прошедших микросекунд с момента старта устройства..."},{"id":1466553600000,"date":"2016-06-22","header":"USB-Midi Контроллер на Arduino","path":"midi-controller","preview":"Помимо веб разработки моим хобби так же является сочинение электронной музыки. Очень часто бывает, что руки заняты музыкальным инструментом и проблематично включать запись или управлять различными эффектами. И выходом из таких ситуаций является midi контроллер, которым можно управлять ногами =). В этой статье я расскажу как можно сделать такой просто и недорого..."},{"id":1452297600000,"date":"2016-01-09","header":"CSS grid","path":"css-grid","preview":"По спецификации CSS-grid - модуль CSS, определяющий двумерную сетку, оптимизированную для дизайна пользовательского интерфейса. В этой сетке дочерние элементы расположены в произвольных ячейках..."},{"id":1442188800000,"date":"2015-09-14","header":"Блог на ангуляре","path":"angular-blog","preview":"Проблема была в том, что этих платформ для блогов десятки и сотни. Не можешь определиться... В общем, решил написать еще один. Свой велосипед..."},{"id":1392854400000,"date":"2014-02-20","header":"White screen of death","path":"white-screen-of-death","preview":"Решение для проблемы совместимости selectivizr и @font-face в IE8.."},{"id":1390521600000,"date":"2014-01-24","header":"Псевдоклассы в CSS","path":"css3-pseudoclasses","preview":"Сегодня использование возможностей CSS3 все больше становится нормой благодаря улучшающейся поддержке браузеров, что не может не радовать. Тем не менее, большая категория верстальщиков консервативно относятся к внедрению такого рода вкусностей в повседневную верстку. И одной из таких штук является спецификация CSS3 Selectors..."}]